Revit 2024 API
StructuralSectionSigmaProfile.MiddleBendLength Property
 Middle Bend segment length.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public double MiddleBendLength { get; set; }
Visual Basic
Public Property MiddleBendLength As Double
	Get
	Set
Visual C++
public:
property double MiddleBendLength {
	double get ();
	void set (double value);
}
See Also
StructuralSectionSigmaProfile Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace